wlbxcj/STM32P10/STMP10/src/driver/encrypt/sm.c
#include "stm32f10x_it.h"
#include "Toolkit.h"
#include "stm32f10x_spi.h"
#include "stm32f10x_lib.h"
#include <string.h>
#include "comm.h"
#include "kf701dh.h"
#include "kb.h"
#include "vosapi.h"

#define FRAME_DELAY_M 40  //us
#define RST_DELAY_M   10000  //uS
#define CS_DELAY_M    10  //uS
#define CMD_DELAY_M   4  //us
#define BYTE_DELAY_M  2   //us
#define END_DELAY_M   2   //us

#define s_DelayUs WaitNuS

#define SPI1_NSS_LOW()     GPIO_ResetBits(GPIOA, GPIO_Pin_4)
#define SPI1_NSS_HIGH()    GPIO_SetBits(GPIOA, GPIO_Pin_4)

#define SPI3_NSS_LOW()     GPIO_ResetBits(GPIOA, GPIO_Pin_15)
#define SPI3_NSS_HIGH()    GPIO_SetBits(GPIOA, GPIO_Pin_15)

#define Lib_sm1           Sm1
#define SMSM2InputSign    SM2_InputSign
#define SMSM2LoadIDSign   SM2_LoadIDSign
#define SMSM2Gen          Sm2_Init //sm2_init ->sm2_Init 
#define SMSM2UnLoad       SM2_UnLoad
#define sm3               Gm_Sm3
#define Lib_sm4           Gm_Sm4   //Gm_sm3->Gm_Sm4
#define SMSM2LoadPK       Sm2_LoadPK //Lib_sm2LoadPK ->Sm2_LoadPK
//#define Sm2_Verify        Gm_Sm2Verify
#define SMSM2Verify       Sm2Verify //Lib_sm2Verify->Sm2Verify
#define SMSM2InputEandGetSign Lib_SM2InputEandGetSign
#define SMSM2LoadIDVerify     Lib_SM2LoadIDVerify

#define s_printf trace_debug_printf //12/11/08

void SPI3_Init(void)
{
  SPI_InitTypeDef    SPI_InitStructure;
  GPIO_InitTypeDef   GPIO_InitStructure;

  //Enable SPI3 clock
  //RCC_APB1PeriphClockCmd(RCC_APB1Periph_SPI2, ENABLE);
  RCC_APB2PeriphClockCmd(RCC_APB1Periph_SPI3, ENABLE);

  //Configure SPI3 pins: NSS, SCK, MISO and MOSI
  /*
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
  */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3 | GPIO_Pin_4 | GPIO_Pin_5;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
  GPIO_Init(GPIOB, &GPIO_InitStructure);

  //Configure PA15 as Output push-pull, used as Flash Chip select
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_15;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOA, &GPIO_InitStructure);

  //SPI3 Config
  SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;//SPI_Direction_2Lines_FullDuplex->SPI_Direction_1Line_Tx
  SPI_InitStructure.SPI_Mode = SPI_Mode_Master;//SPI_Mode_Master->SPI_Mode_Slave
  SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;
  
//#ifdef TEST_SM_M 
  
  SPI_InitStructure.SPI_CPOL = SPI_CPOL_High;//SPI_CPOL_Low->SPI_CPOL_High 13/05/31
  SPI_InitStructure.SPI_CPHA = SPI_CPHA_2Edge;//SPI_CPHA_1Edge->SPI_CPHA_2Edge
  //test
  trace_debug_printf("SPI_CPHA_2Edge\n");
/* 
#else
  SPI_InitStructure.SPI_CPOL = SPI_CPOL_Low;
  SPI_InitStructure.SPI_CPHA = SPI_CPHA_1Edge;

  //test
  trace_debug_printf("SPI_CPHA_1Edge\n");
  
#endif  
*/
  
  SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
  SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_16;
  SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;//SPI_FirstBit_MSB->SPI_FirstBit_LSB
  SPI_Init(SPI3, &SPI_InitStructure);

  SPI3_NSS_HIGH();  
  //SPI3 enable
  SPI_Cmd(SPI3, ENABLE);
}

u8 SPI3DataSendReceive(u8 DATA)
//vu8 SPIDataSendReceive(u8 DATA)
{
    /* Loop while DR register in not emplty */
    while(SPI_GetFlagStatus(SPI3, SPI_FLAG_TXE) == RESET);
    /* Send byte through the SPI1 peripheral */
    SPI_SendData(SPI3, DATA);
    /* Wait to receive a byte */
    while(SPI_GetFlagStatus(SPI3, SPI_FLAG_RXNE) == RESET);
    /* Return the byte read from the SPI bus */
    return SPI_ReceiveData(SPI3);
}

unsigned char calc_lrc(const unsigned char * buf, unsigned int len)
{
	unsigned int lrc = 0;
	for(; len>0; len--, buf++)
	{
		lrc ^= *buf;
	}
	return (lrc&0xff);
}

int SMSendApdu(unsigned int nLen,unsigned char *sData)
{
  unsigned char bLrc;
  unsigned int i;
  
#if 0
  if(bTestFlag==0)
  {
    SelfTest();
    bTestFlag = 1;
  }
#endif
  
#if 0
  //test
  printf("send:");
  for(i=0;i<nLen;i++)
    printf("%02x ",sData[i]);
  printf("\r\n");
#endif
  
  
  bLrc = calc_lrc(sData,nLen)^0xff;
  bLrc ^= nLen&0xff;
  bLrc ^= (nLen>>8)&0xff;
  // Send apdu
  s_DelayUs(FRAME_DELAY_M);
  SPI3_NSS_LOW();
  s_DelayUs( CS_DELAY_M);
  

  SPI3DataSendReceive(0x02);
  s_DelayUs( CMD_DELAY_M);

  
  SPI3DataSendReceive((nLen>>8)&0xff);
  SPI3DataSendReceive(nLen&0xff);
  for(i=0;i<nLen;i++)
    SPI3DataSendReceive(sData[i]);
  SPI3DataSendReceive(bLrc);
  s_DelayUs(END_DELAY_M);
  SPI3_NSS_HIGH();  
  return 0;
}

int SMCheck()
{
  unsigned char bVal;
  s_DelayUs(FRAME_DELAY_M);
  SPI3_NSS_LOW();
  s_DelayUs(CS_DELAY_M);
  SPI3DataSendReceive(0x05);
  s_DelayUs(CMD_DELAY_M);
  
  bVal = SPI3DataSendReceive(0x00);
  
  SPI3_NSS_HIGH();  
  return bVal;
  
}

int SMGetResponse(unsigned int *pnRecLen,unsigned char *sRecBuf, unsigned int max_size)
{
  unsigned int nLen,i;
  unsigned char bLrc;
  
  s_DelayUs(FRAME_DELAY_M);
  SPI3_NSS_LOW();
  s_DelayUs(CS_DELAY_M);
  SPI3DataSendReceive(0x03);
  s_DelayUs(CMD_DELAY_M);
  
  nLen = SPI3DataSendReceive(0x00);
  nLen <<=8;

  nLen |= SPI3DataSendReceive(0x00);
  nLen &=0x7ff;
  if (nLen > max_size) 
    return -1;

  for(i=0;i<nLen;i++)
    sRecBuf[i] = SPI3DataSendReceive(0x00);
  bLrc = SPI3DataSendReceive(0x00);
  
  SPI3_NSS_HIGH();  

  bLrc ^= (nLen&0xff);
  bLrc ^= (nLen>>8)&0xff;
  bLrc ^= calc_lrc(sRecBuf, nLen)^0xff;
  
  if(bLrc != 0) 
  {
  //printf("calc lrc failed: %02x\n", lrc);
  // here can try again to get response or return error
  return -1;

  }
  *pnRecLen = nLen;
  return 0;
  
}
#define GM_BUFFER_LEN       1500

#define GM_CHECK_TIMEOUT    1500        // 最大超时时间1.5秒
/******************************************************************************* 
 * 函数名称: SMCheckWithTimeOut(*)
 * 功能描述: 带超时的检测函数，替代 SMCheck
 * 作    者: WLB
 * 输入参数: 
 * 输出参数: 无
 * 返 回 值: 检测成功返回0   超时返回 -1
 * 其它说明: 无
 * 修改历史: 
 *           1. 2016-10-11  WLB  Created
 *******************************************************************************/
int SMCheckWithTimeOut(void)
{
    unsigned int six_ms = 0;

    while(1)
    {
        if(SMCheck()==0)
            return 0;

