wlbxcj/STM32P10/STMP10/src/driver/encrypt/sm.c
        delay_ms(1);
        if (++six_ms >= GM_CHECK_TIMEOUT)
        {
            trace_debug_printf("%s timeout error.\r\n", __FUNCTION__);
            return -3;
        }
    }
}

int SMGetRand(unsigned int nLc,unsigned char *sRand)
{
    unsigned char sBuf[GM_BUFFER_LEN+5];
    int nRet;
    unsigned int nLen;

    memcpy(sBuf,"\xb0\xa0\x0\x0",4);
    if(nLc > 0xff)
    {
        sBuf[4] = 0;
        sBuf[5] = nLc/0x100;
        sBuf[6] = nLc%0x100;
        SMSendApdu(5+2,sBuf);
    }
    else
    {
        sBuf[4] = (unsigned char)nLc;
        SMSendApdu(5,sBuf);
    }

#if 0
    while(1)
    {
        if(SMCheck()==0)
            break;
        delay_ms(2);//10->2
    }
#else
    if ((nRet = SMCheckWithTimeOut()) != 0)
        return nRet;
#endif /* 0 */

    nLen = 0;
    nRet = SMGetResponse(&nLen,sBuf, sizeof(sBuf));  
    if(nRet==0 )
    {
        if(memcmp(&sBuf[nLen-2],"\x90\x00",2)==0)
            memcpy(sRand,sBuf,nLc);
        else
          return -2;
    }
    return nRet;
}


//加密初始化
/*
mode:1-ENCRYPT

*/
int SMSYMINIT(unsigned char *smkey,int mode)
{
     unsigned char sBuf[GM_BUFFER_LEN];
     int nRet;
     unsigned int nLen;

     //加密初始化
     memcpy(sBuf,"\xB0\x8E\x00\x00\x00",5);
     sBuf[3] =(unsigned char)mode;
     
#if 0
     if(mode==ENCRYPT)
      sBuf[3] = 0x83;
     else
      sBuf[3] = 0x03;
#endif
     
     sBuf[4] = 16;
     memcpy(&sBuf[5],smkey,16);
     
#if 0
     //test
     printf("send:");
     for(i=0;i<5+16;i++)
       printf("%02x ",sBuf[i]);
     printf("\r\n");
#endif
     
     SMSendApdu(5+16,sBuf);
#if 0
    while(1)
    {
        if(SMCheck()==0)
            break;
      delay_ms(1);
    }
#else
    if ((nRet = SMCheckWithTimeOut()) != 0)
        return nRet;
#endif /* 0 */

     nRet = SMGetResponse(&nLen,sBuf, sizeof(sBuf));
     if(nRet==0)
     {
       if(memcmp(sBuf,"\x90\x00",2)==0)
       {
#if 0
     //test
     printf("resp:");
     for(i=0;i<nLen;i++)
       printf("%02x ",sBuf[i]);
     printf("\r\n");
#endif
         return 0;
       }
       else
         return -2;
     }
     
     
     return nRet;      
}

 //加密中间值
int SMSYMMIDD(unsigned char *input,unsigned int input_len,unsigned char *output)
{
     unsigned char sBuf[GM_BUFFER_LEN+10];
     int nRet;
     unsigned int nLen;
    //test
    // int i;

     memset(sBuf,0,sizeof(sBuf));
     memcpy(sBuf,"\xB0\x8E\x01\x00\x00",5);
     if(input_len>0xff)
     {
       sBuf[4] = 0;
       sBuf[5] = input_len/0x100;
       sBuf[6] = input_len%0x100;
       
       //sBuf[4] = (unsigned char)input_len;
       memcpy(&sBuf[7],input,input_len);
     //sBuf[5+input_len] = 16;//le
     
     
      SMSendApdu(5+2+input_len,sBuf);
     }
     else
     {
      sBuf[4] = (unsigned char)input_len;
      memcpy(&sBuf[5],input,input_len);
      //sBuf[5+input_len] = 16;//le
     
     
      SMSendApdu(5+input_len,sBuf);
       
     }
#if 0
     //test
     printf("send:");
     for(i=0;i<5+input_len;i++)
       printf("%02x ",sBuf[i]);
     printf("\r\n");
#endif
     
#if 0
    while(1)
    {
        if(SMCheck()==0)
            break;
      delay_ms(1);
    }
#else
    if ((nRet = SMCheckWithTimeOut()) != 0)
        return nRet;
#endif /* 0 */

     nLen = 0;
     nRet = SMGetResponse(&nLen,sBuf, sizeof(sBuf));
     if(nRet==0)
     {
#if 0
     //test
     printf("11 resp:");
     for(i=0;i<nLen;i++)
       printf("%02x ",sBuf[i]);
     printf("\r\n");
#endif
       if(memcmp(&sBuf[nLen-2],"\x90\x00",2)==0)
       {
         memcpy(output,sBuf,nLen);
         return 0;
       }
       else
       {
#if 0
         //test
         printf("nLen[%d] sw[%02x %02x]\r\n",nLen,sBuf[0],sBuf[1]);
#endif    
         return -2;
       }
     }
     
     
     return nRet;        
}

int SMSYMEND(void)
{
     unsigned char sBuf[GM_BUFFER_LEN];
     int nRet;
     unsigned int nLen;
     //test
     //int i;
     
     //加密结束
     memcpy(sBuf,"\xB0\x8E\x02\x00\x00",5);
     SMSendApdu(5,sBuf);
#if 0
     while(1)
     {
        if(SMCheck()==0)
            break;
        delay_ms(1);
     }
#else
     if ((nRet = SMCheckWithTimeOut()) != 0)
         return nRet;
#endif /* 0 */
     nRet = SMGetResponse(&nLen,sBuf, sizeof(sBuf));
     if(nRet==0)
     {
#if 0
     //test
     printf("resp:");
     for(i=0;i<nLen;i++)
       printf("%02x ",sBuf[i]);
     printf("\r\n");
#endif  
       if(memcmp(sBuf,"\x90\x00",2)==0)
       {
         
         return 0;
       }
       else
         return -2;
     }
     
     
     return nRet;         
}

/*
mode:
  0-SHA1
  1-SHA256
  2-SM3
  3-MD5
*/
int SMHashINIT(int mode)
{
     unsigned char sBuf[GM_BUFFER_LEN];
     int nRet;
     unsigned int nLen;
     //test
     //int i;
 
     //杂凑初始化
     memcpy(sBuf,"\xB0\x8C\x00\x00\x00",5);
     sBuf[3] = mode;

     
 
     
     SMSendApdu(5,sBuf);
     
#if 0
     while(1)
     {
         if(SMCheck()==0)
             break;
         delay_ms(1);
     }
#else
     if ((nRet = SMCheckWithTimeOut()) != 0)
         return nRet;
#endif /* 0 */
     
     nRet = SMGetResponse(&nLen,sBuf, sizeof(sBuf));
     
     if(nRet==0)
     {
       if(memcmp(sBuf,"\x90\x00",2)==0)
       {
#if 0
     //test
     printf("resp:");
     for(i=0;i<nLen;i++)
       printf("%02x ",sBuf[i]);
     printf("\r\n");
#endif
         return 0;
       }
       else
         return -2;
     }
     
     
     return nRet;      
}

//杂凑中间值
int SMHashMIDD(unsigned char *input,unsigned int input_len)
{
     unsigned char sBuf[GM_BUFFER_LEN+10];
     int nRet;
     unsigned int nLen;
    //test
     //int i;

     memset(sBuf,0,sizeof(sBuf));
     memcpy(sBuf,"\xB0\x8C\x01\x00\x00",5);
     if(input_len>0xff)
     {
       sBuf[4] = 0;
       sBuf[5] = input_len/0x100;
       sBuf[6] = input_len%0x100;
       
       //sBuf[4] = (unsigned char)input_len;
       memcpy(&sBuf[7],input,input_len);
     //sBuf[5+input_len] = 16;//le
     
     
      SMSendApdu(5+2+input_len,sBuf);
     }
     else
     {
      sBuf[4] = (unsigned char)input_len;
      memcpy(&sBuf[5],input,input_len);
      //sBuf[5+input_len] = 16;//le
     
     
      SMSendApdu(5+input_len,sBuf);
       
