wlbxcj/STM32P10/STMP10/src/driver/encrypt/sm.c
     }
#if 0
     //test
     printf("send:");
     for(i=0;i<5+input_len;i++)
       printf("%02x ",sBuf[i]);
     printf("\r\n");
#endif
     
#if 0
     while(1)
     {
         if(SMCheck()==0)
             break;
         delay_ms(1);
     }
#else
     if ((nRet = SMCheckWithTimeOut()) != 0)
         return nRet;
#endif /* 0 */
     nLen = 0;
     nRet = SMGetResponse(&nLen,sBuf, sizeof(sBuf));
     if(nRet==0)
     {
#if 0
     //test
     printf("11 resp:");
     for(i=0;i<nLen;i++)
       printf("%02x ",sBuf[i]);
     printf("\r\n");
#endif
       if(memcmp(&sBuf[0],"\x90\x00",2)==0)
       {
         //memcpy(output,sBuf,nLen);
         return 0;
       }
       else
       {
#if 0
         //test
         printf("nLen[%d] sw[%02x %02x]\r\n",nLen,sBuf[0],sBuf[1]);
#endif    
         return -2;
       }
     }
     
     
     return nRet;        
}

int SMHashEND(unsigned char *sOutput )
{
     unsigned char sBuf[GM_BUFFER_LEN];
     int nRet;
     unsigned int nLen;
     //test
     //int i;
     
     //杂凑结束
     memcpy(sBuf,"\xB0\x8C\x02\x00\x00",5);
     sBuf[4] = 32;
     SMSendApdu(5,sBuf);
#if 0
     while(1)
     {
         if(SMCheck()==0)
             break;
         delay_ms(1);//10->2
     }
#else
     if ((nRet = SMCheckWithTimeOut()) != 0)
         return nRet;
#endif /* 0 */
     nRet = SMGetResponse(&nLen,sBuf, sizeof(sBuf));
     if(nRet==0)
     {
#if 0
     //test
     printf("resp:");
     for(i=0;i<nLen;i++)
       printf("%02x ",sBuf[i]);
     printf("\r\n");
#endif  
       if(memcmp(&sBuf[32],"\x90\x00",2)==0)
       {
         memcpy(sOutput,sBuf,32);
         return 0;
       }
       else
         return -2;
     }
     
     
     return nRet;         
}

/****************************************************************************
  函数名     : Lib_sm1
  描述       : SM1加解密
  输入参数   :
			 input:最多为1024字节
			 mode-1为加密
			      0为解密
  输出参数   :
			output-输出16字节
  返回值     :
             0-成功
  修改历史   :
      修改人     修改时间    修改版本号   修改原因
  1、
****************************************************************************/

int Sm1(unsigned char *input,unsigned int input_len,unsigned char *output,unsigned char *smkey,int mode)
{
     int nRet;
     
    // Lib_KbGetCh();
     
     //printf("Lib_sm1 begin\r\n");

     //加密初始化
     if(mode==1)
      nRet = SMSYMINIT(smkey,0x83);
     else
      nRet = SMSYMINIT(smkey,0x03);
     
     if(nRet)
     {
       return nRet;
     }
     
     //加密中间值
     nRet = SMSYMMIDD(input,input_len,output);

#if 0
     
     printf("SMSYMMIDD[%d]\r\n",nRet);
     if(nRet)
     {
       
       return nRet;
     }
#endif
     
     //加密结束
     return SMSYMEND();
}

/****************************************************************************
  函数名     :Lib_sm2init
  描述       :sm2 初始化
  输入参数   :
  输出参数   :
  返回值     :
              0-成功
  修改历史   :
      修改人     修改时间    修改版本号   修改原因
  1、
****************************************************************************/

int Sm2_Init()
{
    unsigned char sBuf[GM_BUFFER_LEN];
    int nRet;
    unsigned int nLen;

    s_printf("Gm_Sm2Init\r\n");
    memcpy(sBuf,"\xB0\xB0\x00\x00\x00",5); //

    SMSendApdu(5,sBuf);
#if 0
     while(1)
     {
         if(SMCheck()==0)
             break;
         delay_ms(1);//10->2
     }
#else
     if ((nRet = SMCheckWithTimeOut()) != 0)
         return nRet;
#endif /* 0 */
    nRet = SMGetResponse(&nLen,sBuf, sizeof(sBuf));
    if(nRet==0)
    {
        if(memcmp(sBuf,"\x90\x00",2)==0)
            return 0;
        else
            return -2;
    }
    return nRet;
  
}

/****************************************************************************
  函数名     :Lib_sm2LoadPK
  描述       :sm2 导入公钥对
  输入参数   :
  输出参数   :
  返回值     :
              0-成功
  修改历史   :
      修改人     修改时间    修改版本号   修改原因
  1、
****************************************************************************/
int Sm2_LoadPK(unsigned char *sPx,unsigned char *sPy)
{
     unsigned char sBuf[GM_BUFFER_LEN];
     int nRet;
     unsigned int nLen;

	 s_printf("Gm_Sm2LoadPK\r\n");
     //memcpy(sBuf,"\xB0\xB4\x00\x02\x20\x39\x88\x36\xF2\xA2\xC5\x1E\xEB\xB8\x37\x06\x0D\x1F\x34\x07\x66\x57\x71\xB4\xD6\x0E\x1F\x5E\x19\x61\x82\x6E\xBB\x9B\x48\xD3\x3D",37);
     memcpy(sBuf,"\xB0\xB4\x00\x02\x20",5);
     memcpy(&sBuf[5],sPx,32);
     SMSendApdu(37,sBuf);
#if 0
     while(1)
     {
         if(SMCheck()==0)
             break;
         delay_ms(1);//10->2
     }
#else
     if ((nRet = SMCheckWithTimeOut()) != 0)
         return nRet;
#endif /* 0 */
     nRet = SMGetResponse(&nLen,sBuf, sizeof(sBuf));
     if(nRet)
       return nRet;
     if(memcmp(sBuf,"\x90\x00",2))
       return -2;
     
     //y
     //memcpy(sBuf,"\xB0\xB4\x00\x03\x20\x42\x91\x74\xC5\x7F\xAB\x0A\x9C\xDD\xD4\xE7\x48\xE3\x37\x11\xA9\x8A\x66\x0C\x49\x77\xFF\xC2\x3F\xC5\x0A\xB0\x92\xD8\x17\x46\xAD",37);
     memcpy(sBuf,"\xB0\xB4\x00\x03\x20",5);
     memcpy(&sBuf[5],sPy,32);
     SMSendApdu(37,sBuf);
#if 0
     while(1)
     {
         if(SMCheck()==0)
             break;
         delay_ms(1);//10->2
     }
#else
     if ((nRet = SMCheckWithTimeOut()) != 0)
         return nRet;
#endif /* 0 */
     nRet = SMGetResponse(&nLen,sBuf, sizeof(sBuf));
     
     if(nRet)
       return nRet;
     if(memcmp(sBuf,"\x90\x00",2))
       return -2;
     
     return nRet;     
     
}
//sxl
int Sm2_Load_PrivateKey(unsigned char *d)
{
     unsigned char sBuf[GM_BUFFER_LEN];
     int nRet;
     unsigned int nLen;

     s_printf("Sm2_Load_PrivateKey\r\n");
     memcpy(sBuf,"\xB0\xB4\x00\x01\x20",5);
     memcpy(&sBuf[5],d,32);
     SMSendApdu(37,sBuf);
#if 0
     while(1)
     {
         if(SMCheck()==0)
             break;
         delay_ms(1);//10->2
     }
#else
     if ((nRet = SMCheckWithTimeOut()) != 0)
         return nRet;
#endif /* 0 */

     nRet = SMGetResponse(&nLen, sBuf, sizeof(sBuf));
     if(nRet)
       return nRet;
     if(memcmp(sBuf,"\x90\x00",2))
       return -2;
     return nRet;     
}
//sxl
int Sm2_GetZ(unsigned char *id, int id_len, unsigned char *Z)
{
    unsigned char sBuf[GM_BUFFER_LEN];
  int nRet;
  unsigned int nLen, count;

