wlbxcj/STM32P10/STMP10/src/driver/encrypt/sm.c
  count = 0;
  memcpy(sBuf,"\xB0\x74\x01\x00",4); 
  count += 4;
  sBuf[4] = id_len;
  count += 1;
  memcpy(&sBuf[count], id, id_len);
  count += id_len;  
  SMSendApdu(count,sBuf);
#if 0
     while(1)
     {
         if(SMCheck()==0)
             break;
         delay_ms(1);//10->2
     }
#else
     if ((nRet = SMCheckWithTimeOut()) != 0)
         return nRet;
#endif /* 0 */
    nRet = SMGetResponse(&nLen,sBuf, sizeof(sBuf));
  if(nRet==0)
  {
    if(memcmp(&sBuf[nLen-2],"\x90\x00",2)==0) {
	  memcpy(Z, sBuf, 32);
      return 0;
    }
    else
      return -2;
  }
  return nRet;	
}
static const unsigned char sm2_param[128] = {
0xFF,0xFF,0xFF,0xFE,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,
0xFF,0xFF,0xFF,0xFF,0x00,0x00,0x00,0x00,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFC,
0x28,0xE9,0xFA,0x9E,0x9D,0x9F,0x5E,0x34,0x4D,0x5A,0x9E,0x4B,0xCF,0x65,0x09,0xA7,
0xF3,0x97,0x89,0xF5,0x15,0xAB,0x8F,0x92,0xDD,0xBC,0xBD,0x41,0x4D,0x94,0x0E,0x93,
0x32,0xC4,0xAE,0x2C,0x1F,0x19,0x81,0x19,0x5F,0x99,0x04,0x46,0x6A,0x39,0xC9,0x94,
0x8F,0xE3,0x0B,0xBF,0xF2,0x66,0x0B,0xE1,0x71,0x5A,0x45,0x89,0x33,0x4C,0x74,0xC7,
0xBC,0x37,0x36,0xA2,0xF4,0xF6,0x77,0x9C,0x59,0xBD,0xCE,0xE3,0x6B,0x69,0x21,0x53,
0xD0,0xA9,0x87,0x7C,0xC6,0x2A,0x47,0x40,0x02,0xDF,0x32,0xE5,0x21,0x39,0xF0,0xA0,
}; 
int Gm_Sm3( unsigned char *input, int ilen, unsigned char *output);

int Sm2_GetE(const unsigned char *id, unsigned int idLen, 
   const unsigned char *publicKey, const unsigned char *msg, unsigned int msgLen, 
   unsigned char *e)
{
	unsigned char buf[GM_BUFFER_LEN];
	unsigned char h[32];
	int totalLen;
	 
    memset(buf, 0, sizeof(buf));
	//第一次sm3: id的BIT长度（2字节) + id + sm2的那些参数128字节+公钥（0x40字节)
	buf[0] = ((idLen * 8) >> 8) & 0xff;
	buf[1] = (idLen * 8) & 0xff;
	memcpy(buf + 2, id, idLen);
	totalLen = 2 + idLen;
	memcpy(buf + totalLen, sm2_param, 128);
	totalLen += 128;
	memcpy(buf + totalLen, publicKey, 0x40);
	totalLen += 0x40;
	if(Gm_Sm3(buf, totalLen, h) != 0)
	{
		s_printf("sm3 c1error");
		return -1;
	}	 
	//第二次Sm3: 第一次算出的哈希值+要验证的消息数据
    memset(buf, 0, sizeof(buf));
	memcpy(buf, h, 0x20);
	totalLen = 0x20;
	memcpy(buf + totalLen, msg, msgLen);
	totalLen += msgLen;
	if(Gm_Sm3(buf, totalLen, h) != 0)
	{
		s_printf("sm3 c2error");
		return -2;
	}
	memcpy(e, h, 0x20);
	return 0;
}

/****************************************************************************
  函数名     :Lib_sm2Verify
  描述       :对输入的杂凑值E与 (R,S)验签
  输入参数   :
              E-32 字节
  输出参数   :
  返回值     :
              0-成功
  修改历史   :
      修改人     修改时间    修改版本号   修改原因
  1、
****************************************************************************/
int Sm2Verify(unsigned char *E,unsigned char * R,unsigned char * S)
{
    unsigned char sBuf[GM_BUFFER_LEN];
    int nRet;
    unsigned int nLen;

     //memcpy(sBuf,"\xB0\x74\x00\x00\x60\xDC\xF5\x5F\x9B\x30\xED\xC1\x30\x79\x60\x6D\x62\x80\xB7\x52\x58\x7B\xDB\xA6\x2F\x47\x1A\x3D\xA7\x7A\xA3\x49\x73\xAA\x3E\x47\x14\x9F\x8E\x28\xEE\x47\x05\x7B\x7B\xD0\x01\xB6\x11\x39\x1D\x80\xDF\x5D\xA7\x20\x3F\x3D\x30\x0E\xEC\xFB\x32\x43\xC4\x49\x8B\xA1\x0C\xFE\x3F\xB9\x1A\xB1\x5A\xA0\x37\x62\x10\xA3\xF6\x75\x11\x93\x0C\x2E\xF0\x32\x97\x01\x71\x67\xB5\x2A\xE5\x06\x03\xCA\x34\xDF\xED",101);
	 s_printf("Gm_Sm2Verify\r\n");
	 memcpy(sBuf,"\xB0\x74\x00\x00\x60",5);
     
     memcpy(&sBuf[5],E,32);
     memcpy(&sBuf[5+32],R,32);
     memcpy(&sBuf[5+64],S,32);
     
     SMSendApdu(101,sBuf);
#if 0
     while(1)
     {
         if(SMCheck()==0)
             break;
         delay_ms(1);//10->2
     }
#else
     if ((nRet = SMCheckWithTimeOut()) != 0)
         return nRet;
#endif /* 0 */
     nRet = SMGetResponse(&nLen,sBuf, sizeof(sBuf));
     if(nRet==0)
     {
       if(memcmp(sBuf,"\x90\x00",2)==0)
         return 0;
       else
         return -2;
     }
     return nRet;
}

//int Gm_Sm2Verify(unsigned char *user_id, int userid_len,const 
//unsigned char * public_key,unsigned char * signed_data, unsigned char *msg, int msg_len)
int Sm2_Verify(unsigned char *user_id, int userid_len,const 
  unsigned char * public_key,unsigned char * signed_data, unsigned char *msg, int msg_len)
{
	unsigned char px[32], py[32];
	unsigned char E[32], R[32], S[32];
	if (Sm2_Init() != 0)
		return -1;
	memcpy(px, public_key, 32);
	memcpy(py, &public_key[32], 32);	
    if (Sm2_LoadPK(px, py) != 0)
		return -2;
	if (Sm2_GetE(user_id, userid_len, public_key, msg, msg_len, E) != 0)
		return -3;
	memcpy(R, signed_data, 32);
	memcpy(S, &signed_data[32], 32);
	if (Sm2Verify(E,R,S) != 0)
		return -4;

	return 0;
}

//sxl 14/3/25
int Sm2_ExportPK(unsigned char bPara,unsigned char *sOutput)
{
    unsigned char sBuf[GM_BUFFER_LEN];
    int nRet;
    unsigned int nLen;

    memcpy(sBuf,"\xB0\xB2\x00\x00\x20",5); //
    sBuf[3] = bPara;
    SMSendApdu(5,sBuf);
#if 0
     while(1)
     {
         if(SMCheck()==0)
             break;
         delay_ms(1);//10->2

     }
#else
     if ((nRet = SMCheckWithTimeOut()) != 0)
         return nRet;
#endif /* 0 */
    nRet = SMGetResponse(&nLen,sBuf, sizeof(sBuf));
    if(nRet==0)
    {
        if(memcmp(&sBuf[32],"\x90\x00",2)==0)
        {
            memcpy(sOutput,sBuf,32);
            return 0;
        }
        else
            return -2;
    }
    return nRet;  
}
//sxl
int Lib_SM2GetSign(unsigned char *sOutputE,unsigned char *sOutputR,unsigned char *sOutputS)
{
    unsigned char sBuf[GM_BUFFER_LEN];
    int nRet;
    unsigned int nLen=0;

    memcpy(sBuf,"\xB0\x72\x03\x01\x60",5); //00->01
    SMSendApdu(5,sBuf);
#if 0
     while(1)
     {
         if(SMCheck()==0)
             break;
         delay_ms(1);//10->2

     }
#else
     if ((nRet = SMCheckWithTimeOut()) != 0)
         return nRet;
#endif /* 0 */
    nRet = SMGetResponse(&nLen,sBuf, sizeof(sBuf));
    if(nRet==0)
    {
        if(memcmp(&sBuf[32*3],"\x90\x00",2)==0)
        {
            memcpy(sOutputE,sBuf,32);
            memcpy(sOutputR,&sBuf[32],32);
            memcpy(sOutputS,&sBuf[32*2],32);
            return 0;
        }
        else
        {
            s_printf("SW[%02x %02x]\r\n",sBuf[64],sBuf[65]);
            return -2;
        }
    }
    return nRet;  
}
//sxl
int Lib_SM2LoadIDSign(unsigned char bInputLen,unsigned char *sInputID)
{
    unsigned char sBuf[GM_BUFFER_LEN];
     int nRet;
     unsigned int nLen;

