wlbxcj/STM32P10/STMP10/src/driver/encrypt/sm.c
     //memcpy(sBuf,"\xB0\x72\x01\x00\x08\x11\x22\x33\x44\x55\x66\x77\x88\x20",14); //
     memcpy(sBuf,"\xB0\x72\x01\x01\x08",5); //00->01
     sBuf[4] = bInputLen;
     memcpy(&sBuf[5],sInputID,bInputLen);
     sBuf[5+bInputLen] = 0x20;
     //SMSendApdu(14,sBuf);
     SMSendApdu(5+bInputLen+1,sBuf);
#if 0
     while(1)
     {
         if(SMCheck()==0)
             break;
         delay_ms(1);//10->2
     }
#else
     if ((nRet = SMCheckWithTimeOut()) != 0)
         return nRet;
#endif /* 0 */
    nRet = SMGetResponse(&nLen,sBuf, sizeof(sBuf));
    if(nRet==0)
    {
      if(memcmp(&sBuf[32],"\x90\x00",2)==0)
        return 0;
      else
      {
        s_printf("SW[%02x %02x]\r\n",sBuf[0],sBuf[1]);
        return -2;
      }
    }
    return nRet;
}
//sxl
int Lib_SM2InputEandGetSign(unsigned char *sInputE,unsigned char *sOutputR,unsigned char *sOutputS)
{
    unsigned char sBuf[GM_BUFFER_LEN];
    int nRet;
    unsigned int nLen;

    memcpy(sBuf,"\xB0\x72\x00\x00\x20",5); //
    memcpy(&sBuf[5],sInputE,32);
    sBuf[5+32] = 0x40;
    SMSendApdu(5+32+1,sBuf);
#if 0
     while(1)
     {
         if(SMCheck()==0)
             break;
         delay_ms(1);//10->2
     }
#else
     if ((nRet = SMCheckWithTimeOut()) != 0)
         return nRet;
#endif /* 0 */
    nRet = SMGetResponse(&nLen,sBuf, sizeof(sBuf));
    if(nRet==0)
    {
        if(memcmp(&sBuf[64],"\x90\x00",2)==0)
        {
            memcpy(sOutputR,sBuf,32);
            memcpy(sOutputS,&sBuf[32],32);
            return 0;
        }
        else
        {
            s_printf("SW[%02x %02x]\r\n",sBuf[64],sBuf[65]);
            return -2;
        }
    }
    return nRet;  
}
//sxl
int Lib_SM2InputSign(unsigned char bInputLen,unsigned char *sInput)
{
    unsigned char sBuf[GM_BUFFER_LEN];
     int nRet;
     unsigned int nLen;

     memcpy(sBuf,"\xB0\x72\x02\x01\x00",5); //00->01
     sBuf[4] = bInputLen;
     memcpy(&sBuf[5],sInput,bInputLen);
     //SMSendApdu(14,sBuf);
     SMSendApdu(5+bInputLen,sBuf);
#if 0
     while(1)
     {
         if(SMCheck()==0)
             break;
         delay_ms(1);//10->2
     }
#else
     if ((nRet = SMCheckWithTimeOut()) != 0)
         return nRet;
#endif /* 0 */
    nRet = SMGetResponse(&nLen,sBuf, sizeof(sBuf)); 
    if(nRet==0)
    {
      if(memcmp(&sBuf[0],"\x90\x00",2)==0)
        return 0;
      else
        return -2;
    }
    return nRet;
}
//sxl
int Lib_SM2LoadIDVerify(unsigned char bInputLen,unsigned char *sInputID)
{
    unsigned char sBuf[GM_BUFFER_LEN];
     int nRet;
     unsigned int nLen;

     memcpy(sBuf,"\xB0\x74\x01\x00\x08",5); //
     sBuf[4] = bInputLen;
     memcpy(&sBuf[5],sInputID,bInputLen);
     sBuf[5+bInputLen] = 0x20;
     SMSendApdu(5+bInputLen+1,sBuf);
#if 0
     while(1)
     {
        if(SMCheck()==0)
            break;
        delay_ms(1);//10->2
     }
#else
    if ((nRet = SMCheckWithTimeOut()) != 0)
        return nRet;
#endif /* 0 */
    nRet = SMGetResponse(&nLen,sBuf, sizeof(sBuf)); 
    if(nRet==0)
    {
      if(memcmp(&sBuf[32],"\x90\x00",2)==0)
        return 0;
      else
        return -2;
    }
    return nRet;
}
//sxl
int Gm_Sm2Sign(unsigned char *user_id, int userid_len, const unsigned char *public_key,
	unsigned char *private_Key, unsigned char *sign, unsigned char *msg,int msg_len)
{
	unsigned char px[32], py[32], d[32];
	unsigned char E[32], R[32], S[32];

	if (Sm2_Init() != 0)
		return -1;
	memcpy(d, private_Key, 32); 
	if (Sm2_Load_PrivateKey(d) != 0)
		return -2;
	memcpy(px, public_key, 32);
	memcpy(py, &public_key[32], 32);
    if (Sm2_LoadPK(px, py) != 0)
		return -3;
	#if 0
	if (Lib_SM2InputSign(msg_len, msg)!=0)
		return -4;
	if (Lib_SM2GetSign(E,R,S))
		return -5;
	if(Sm2Verify(E,R,S))
		s_UartPrint("verify err in sing\r\n");
	#else
	if (Sm2_GetE(user_id, userid_len, public_key, msg, msg_len, E))
		return -4;
	if (Lib_SM2InputEandGetSign(E, R, S)!=0)
		return -6;
	#endif
	memcpy(sign, R, 32);
	memcpy(sign+32, S, 32);
	return 0;
}
#if 0
static unsigned char sm2_public_key[] = 
{
	0xDF,0xEF,0x37,0x7B,0xE5,0x2F,0x4D,0x03,0x09,0xC7,0x6E,0xEC,0x6F,0x15,0xF6,0xD6,
	0x5C,0xBE,0x12,0x82,0xD2,0xAB,0x84,0x41,0x31,0xE2,0x5A,0x38,0xC0,0x8C,0xF4,0x25,
	0x29,0x39,0xEB,0xC6,0x1A,0x62,0xBF,0x6F,0x39,0xF9,0x2B,0x44,0x59,0xBE,0x2E,0xE4,
	0x17,0x13,0x38,0x43,0xE2,0x47,0xF7,0xC8,0xAC,0x5F,0x53,0xB1,0x35,0x80,0x63,0xA5
};

static unsigned char sm2_private_key[] =
{
	0x87,0x21,0x44,0x1C,0xC2,0x7D,0x73,0x97,0x1F,0x35,0x17,0xAE,0x33,0xCE,0xF5,0xC7,
	0x7B,0x6F,0xD3,0x37,0x5F,0x3F,0x40,0x4F,0x4D,0x17,0x09,0xF3,0x0A,0xEA,0xFB,0xFF
};

static unsigned char sm2_signer_id[] =
{
	0x30,0xD2,0xF3,0xB2,0xD2,0x51,0x06,0xB4,0x16,0x98,0x5A,0x5A,0xE7,0xD6,0xB6,0xC7,
	0x47,0x76,0x1A,0x29,0xAF,0xD6,0xB9,0x98,0x64,0x7E,0x3D,0x64,0x06,0x21,0x34,0xB0
};

static unsigned char sm2_data_len = 0x20;

static unsigned char sm2_data[] = 
{
	0x9F,0x8A,0xFD,0x39,0x77,0xED,0xBE,0xFD,0xFD,0x65,0x33,0x1D,0x23,0x67,0xF1,0x15,
	0x08,0x80,0x2F,0x50,0xEB,0x65,0x74,0x71,0xB5,0x34,0x7F,0x7E,0x04,0x21,0x08,0xB3
};

static unsigned char sm2_signed_data[] = 
{
	0x29,0xF0,0x66,0x2E,0xEE,0xD2,0x75,0xAB,0x17,0xBC,0xA4,0xE9,0x04,0x3D,0x1F,0xFC,
	0xEE,0xF9,0x90,0xF2,0xE9,0x06,0xAE,0x3C,0x46,0x39,0x85,0x74,0x42,0x1A,0x21,0x8D,
	0x30,0x9D,0x8E,0xE5,0x19,0xAA,0x9A,0x7D,0x77,0xEA,0xF5,0xE4,0x36,0xBC,0xC6,0xCC,
	0x68,0x59,0x4A,0x3A,0x9D,0xC1,0x86,0xD2,0x33,0xC2,0xCD,0xD5,0xAD,0x11,0xD5,0xE6
};
#endif
/****************************************************************************
  函数名     :Lib_sm3
  描述       :杂凑值
  输入参数   :
  输出参数   :
  返回值     :
           
  修改历史   :
      修改人     修改时间    修改版本号   修改原因
  1、
****************************************************************************/

int Gm_Sm3( unsigned char *input, int ilen, unsigned char *output)
{
    int nRet ,count,tmp,i;

  nRet = SMHashINIT(2);
  if(nRet)
	return nRet;

#if 0   //org    一次性传入数据
    nRet = SMHashMIDD(input,ilen);
    if(nRet)
      return nRet;
#else    //分段传输，每次传输240字节
    count = ilen/240;
    tmp = ilen%240;
    for(i=0;i<count;i++)
    {
        nRet = SMHashMIDD(&input[i*240],240);
        if(nRet)
            return nRet;
    }
    if(tmp)
    {
        nRet = SMHashMIDD(&input[count*240],tmp);
        if(nRet)
        return nRet;
    }
       
#endif

