wlbxcj/STM32P10/STMP10/src/driver/encrypt/sm.c
  nRet = SMHashEND(output);
  if(nRet)
	return nRet;

  return 0;
}

/****************************************************************************
  函数名     : Lib_sm4
  描述       : SM4加解密
  输入参数   :
			 input:最多为1024字节
			 mode-1为加密
			      0为解密
  输出参数   :
			output-输出16字节
  返回值     :
           0-成功
  修改历史   :
      修改人     修改时间    修改版本号   修改原因
  1、
****************************************************************************/
int Gm_Sm4(unsigned char *input,unsigned int input_len,unsigned char *output,unsigned char *smkey,int mode)
{
     int nRet;

     if(mode)
         nRet = SMSYMINIT(smkey,0x85);
     else
         nRet = SMSYMINIT(smkey,0x05);
     if(nRet)
         return nRet;
     //加密中间值
     nRet = SMSYMMIDD(input,input_len,output);
	 if (nRet)
	     return nRet;
	 nRet = SMSYMEND();
	 if (nRet)
	     return nRet;
#if 0
     
     printf("SMSYMMIDD[%d]\r\n",nRet);
     if(nRet)
     {
       
       return nRet;
     }
#endif
     
     //加密结束
     return 0;  
}

#if 1
static const unsigned char publicKey[0x40] =  //公钥
{
	0x92,0xE1,0x4A,0xCD,0x01,0xE3,0x70,0x75,0xC8,0x34,0x9C,0x60,0xAE,0x98,0xFA,0x9E,
	0x43,0xA0,0x6A,0x96,0xF6,0x80,0xD2,0x08,0xB0,0x4B,0x3A,0x2D,0x63,0x97,0xE5,0xFC,
	0xFE,0x9E,0x37,0x29,0x9D,0x3C,0x6F,0x33,0xC0,0x6E,0xB6,0xF4,0xB7,0x4E,0xAC,0xAC,
	0x89,0x53,0x41,0x36,0x12,0x19,0x09,0xB4,0x16,0x13,0x42,0x76,0x37,0x88,0xF6,0x5D
};
 
static unsigned char id[16] = //用户ID
{
	 0x31, 0x32, 0x33, 0x34, 0x35, 0x36, 0x37, 0x38, 0x31, 0x32, 0x33, 0x34, 0x35, 0x36, 0x37, 0x38 
};
 
static unsigned char msg[14 + 0x40] = //验证的消息
{
	0x12,0x62,0x22,0x35,0xFF,0x12,0x30,0x00,0x00,0x03,0x04,0x00,0x11, 0x40,
	0xC8,0x4C,0x27,0xE5,0x85,0xC6,0x5B,0xEB,0xFE,0x8A,0xDC,0x04,0x44,0x67,0x1C,0x59,
	0x36,0x10,0x2F,0xFC,0x4B,0x89,0x41,0xFF,0x14,0x57,0xCF,0x73,0xAB,0x3E,0xE4,0xAA,
	0x16,0xAF,0xC2,0x6B,0x5D,0x20,0x85,0xC2,0xF1,0x23,0x86,0x83,0xD8,0x3C,0x81,0x09,
	0x10,0xE5,0xFE,0x6A,0x3A,0xCC,0xDE,0x64,0x01,0xE6,0xA7,0x75,0xC3,0x90,0x8B,0xDD
};
 
static unsigned char sign[0x40] = //对数据的签名
{
	0x58,0x32,0x55,0x8B,0x8E,0x42,0x73,0x46,0xAE,0x8F,0xCD,0xD1,0x18,0x8F,0x3D,0xDE,
	0xD3,0xAE,0x68,0x7E,0x4A,0x77,0x8D,0xD6,0x69,0x7F,0xC5,0x71,0x5A,0xC2,0x27,0x8B,
	0x86,0x66,0x99,0x2D,0xB8,0x87,0xCE,0x43,0x57,0x09,0x4D,0xA8,0x35,0x9C,0x3A,0x44,
	0x00,0x60,0x1C,0x72,0x1A,0x59,0x6D,0xB1,0x16,0x34,0x59,0xC8,0x4C,0x11,0x4C,0x84
};

static unsigned char sm4_data[16] =
{
	0xAA,0x22,0x33,0x44,0x55,0x66,0x77,0x88,0x11,0x22,0x33,0x44,0x55,0x66,0x77,0x88

};

static unsigned char sm4_key[16] =
{
	0x11,0x22,0x33,0x44,0x55,0x66,0x77,0x88,0x11,0x22,0x33,0x44,0x55,0x66,0x77,0x88

};

static unsigned char sm4_out[16] =
{
	0x95,0x0F,0xA2,0xC8,0x8C,0x42,0xAB,0x1C,0xE0,0xD6,0xFC,0x25,0xC1,0xB5,0x48,0x51
};

void gm_test(void)
{
	unsigned char out[16];
    int ret;

    Lib_LcdCls();
    Lib_LcdPrintxy(0, 0, 0x80, "     GM TEST    ");
    Lib_LcdPrintxy(0, 1*8, 0x00, "do ing...");
    Lib_KbFlush();

	s_printf("********Sm4 Test********\r\n");
	Gm_Sm4(sm4_data,16, out, sm4_key, 1);
	if (memcmp(out, sm4_out, 16) == 0) {
		s_printf("SM4加密: 成功");
        Lib_LcdClrLine(2*8, LCD_HIGH_MINI-1);
		Lib_LcdPrintxy(0, 1*8, 0x00, "SM4 encrypt ok");
        Lib_KbFlush();
	} else {
		s_printf("SM4加密: 失败");
        Lib_LcdClrLine(2*8, LCD_HIGH_MINI-1);
		Lib_LcdPrintxy(0, 1*8, 0x00, "SM4 encrypt error");
        Lib_KbFlush();
	}
    DelayMs(1000);

    Gm_Sm4(sm4_out,16, out, sm4_key, 0);
	if (memcmp(out, sm4_data, 16) == 0) {
		s_printf("SM4解密: 成功");
        Lib_LcdClrLine(2*8, LCD_HIGH_MINI-1);
		Lib_LcdPrintxy(0, 1*8, 0x00, "SM4 decryption ok");
        Lib_KbFlush();
	} else {
		s_printf("SM4解密: 失败");
        Lib_LcdClrLine(2*8, LCD_HIGH_MINI-1);
		Lib_LcdPrintxy(0, 1*8, 0x00, "SM4 decryption error");
        Lib_KbFlush();
	}
    DelayMs(1000);

	s_printf("********Sm2 Test********\r\n");
	//Gm_Sm2Verify(id, 16, publicKey, sign, msg, sizeof(msg));
    ret = Sm2_Verify(id, 16, publicKey, sign, msg, sizeof(msg));
	if (ret == 0) {
		s_printf("SM2验签: 成功");
        Lib_LcdClrLine(2*8, LCD_HIGH_MINI-1);
		Lib_LcdPrintxy(0, 1*8, 0x00, "SM2 ok");
        Lib_KbFlush();
	} else {
		s_printf("SM2验签: 失败");
        Lib_LcdClrLine(2*8, LCD_HIGH_MINI-1);
		Lib_LcdPrintxy(0, 1*8, 0x00, "SM2 error");
        Lib_KbFlush();
	}
	
	s_printf("********Finish********\r\n");

	Kb_GetKey();
}
#endif


int SMSM1SelfTest(void)
{
  unsigned char sKey[16];
  unsigned char sInput[16];
  unsigned char sOutput[16],sBuf[100];
  memcpy(sKey,"\xD6\x1D\xA6\x8C\xE0\xC4\x26\x61\x0A\x97\x8E\x68\xEB\xC2\xA9\x8E",16);
  memcpy(sInput,"\xA6\x2A\x0A\x3E\xBC\xA8\x85\x36\xAA\x0A\x56\xA7\xB6\x81\x48\x3E",16);
  memcpy(sOutput,"\x8E\x4B\x87\x01\x0B\xCD\xE1\x13\x22\x09\x12\x7F\xEB\x06\xAA\x70",16);
  Lib_sm1(sInput,16,sBuf,sKey,1); 
  if(memcmp(sBuf,sOutput,16))
    return 1;
  Lib_sm1(sOutput,16,sBuf,sKey,0); 
  if(memcmp(sBuf,sInput,16))
    return 1;
  return 0;
}

int SMSM2SelfTest(void)
{
    int iret;
  
    iret = SMSM2Gen();
    s_printf("SMSM2Gen[%d]\r\n",iret);
    //iret = SMSM2LoadIDVerify(32,"\x1D\x18\x8B\x6F\x97\x9D\xB6\x3D\xF1\x5D\x93\x33\x54\x3D\xA9\x39\x69\x25\x4B\xD4\x30\x70\x7B\x62\x9D\xE2\x1D\x3F\x29\xAD\x49\x23");
    iret = SMSM2LoadIDVerify(8,"\x11\x22\x33\x44\x55\x66\x77\x88");
    s_printf("SMSM2LoadIDVerify[%d]\r\n",iret);
    
#if 0
    //iret = SMSM2Load(2,"\x1D\x18\x8B\x6F\x97\x9D\xB6\x3D\xF1\x5D\x93\x33\x54\x3D\xA9\x39\x69\x25\x4B\xD4\x30\x70\x7B\x62\x9D\xE2\x1D\x3F\x29\xAD\x49\x23");    
    iret = SMSM2Load(2,"\x39\x88\x36\xF2\xA2\xC5\x1E\xEB\xB8\x37\x06\x0D\x1F\x34\x07\x66\x57\x71\xB4\xD6\x0E\x1F\x5E\x19\x61\x82\x6E\xBB\x9B\x48\xD3\x3D");    
    printf("SMSM2Load[%d]\r\n",iret);
    //iret = SMSM2Load(3,"\x5C\xF7\x4F\x72\x80\x44\x46\xC1\x48\x40\x80\xB7\x78\xF8\xD7\xDD\x6B\x1D\x32\x11\x28\x35\x20\x1C\xC8\xBA\xE0\x6A\xA8\xDB\x0C\xD7");    
    iret = SMSM2Load(3,"\x42\x91\x74\xC5\x7F\xAB\x0A\x9C\xDD\xD4\xE7\x48\xE3\x37\x11\xA9\x8A\x66\x0C\x49\x77\xFF\xC2\x3F\xC5\x0A\xB0\x92\xD8\x17\x46\xAD");    
#endif
    
    iret = SMSM2LoadPK("\x39\x88\x36\xF2\xA2\xC5\x1E\xEB\xB8\x37\x06\x0D\x1F\x34\x07\x66\x57\x71\xB4\xD6\x0E\x1F\x5E\x19\x61\x82\x6E\xBB\x9B\x48\xD3\x3D",
                       "\x42\x91\x74\xC5\x7F\xAB\x0A\x9C\xDD\xD4\xE7\x48\xE3\x37\x11\xA9\x8A\x66\x0C\x49\x77\xFF\xC2\x3F\xC5\x0A\xB0\x92\xD8\x17\x46\xAD");
    
    
    s_printf("SMSM2Load[%d]\r\n",iret);
    //iret = SMSM2InputVerify(32,w"\xB1\xD5\xB8\x72\xCC\x3C\x37\x5F\x9E\xAD\xFB\x06\x67\x03\xA8\x0F\x58\x2C\x0E\xA3\xDF\x9F\x6B\xD1\x08\xBC\x14\x58\xF9\x76\xEB\x23");
    //printf("SMSM2InputVerify[%d]\r\n",iret);
    
    //iret = SMSM2VerifyNoE("\xED\x17\x9B\x31\x65\x04\xD1\xDF\xB4\xEC\xDF\x4C\xB7\xDC\x0C\x20\xDD\x75\x66\x5A\xFE\x4A\x9B\x6A\xB6\x08\x1C\x1E\x27\xD3\x29\x2E",
    //                      "\x67\x02\x64\xB9\x02\xF7\x6C\x67\xEC\x02\xB9\x1E\x39\xCE\xA0\x8D\xA7\xBF\x7E\xAC\x80\xEB\xF2\xFA\xDE\xE1\xC5\xFF\x64\x45\xA8\xDF");
    iret = SMSM2Verify("\xDC\xF5\x5F\x9B\x30\xED\xC1\x30\x79\x60\x6D\x62\x80\xB7\x52\x58\x7B\xDB\xA6\x2F\x47\x1A\x3D\xA7\x7A\xA3\x49\x73\xAA\x3E\x47\x14",
                       "\x9F\x8E\x28\xEE\x47\x05\x7B\x7B\xD0\x01\xB6\x11\x39\x1D\x80\xDF\x5D\xA7\x20\x3F\x3D\x30\x0E\xEC\xFB\x32\x43\xC4\x49\x8B\xA1\x0C",
                       "\xFE\x3F\xB9\x1A\xB1\x5A\xA0\x37\x62\x10\xA3\xF6\x75\x11\x93\x0C\x2E\xF0\x32\x97\x01\x71\x67\xB5\x2A\xE5\x06\x03\xCA\x34\xDF\xED");
    return iret;
}

int SMSM3SelfTest(void)
{
  unsigned char sOutput[32];
  sm3("\x55",1,sOutput);
  if(memcmp(sOutput,"\x65\x7A\x94\xD4\xF1\x56\x95\x63\x30\x05\xEC\x90\x9A\xC5\x65\x51\x11\x59\x9B\xCD\x82\x78\xB7\x5D\x18\x3B\x86\xFE\xEB\x77\x8B\xFF",32))
    return 1;
  return 0;
}

int SMSM4SelfTest(void)
{
  unsigned char sKey[16];
  unsigned char sInput[16];
  unsigned char sOutput[16],sBuf[100];
  memcpy(sKey,"\x11\x22\x33\x44\x55\x66\x77\x88\x11\x22\x33\x44\x55\x66\x77\x88",16);
  memcpy(sInput,"\xAA\x22\x33\x44\x55\x66\x77\x88\x11\x22\x33\x44\x55\x66\x77\x88",16);
  memcpy(sOutput,"\x95\x0F\xA2\xC8\x8C\x42\xAB\x1C\xE0\xD6\xFC\x25\xC1\xB5\x48\x51",16);
  Lib_sm4(sInput,16,sBuf,sKey,1); 
  if(memcmp(sBuf,sOutput,16))
    return 1;
  Lib_sm4(sOutput,16,sBuf,sKey,0); 
  if(memcmp(sBuf,sInput,16))
    return 1;
  return 0;
}


